nutabi/sendmy/examples/espbench/sdkconfig.defaults
# ----------------------------------------------------------------------------
# Target and build settings
# ----------------------------------------------------------------------------

# Target board
CONFIG_IDF_TARGET="esp32s3"

# Reproducible build (easier to profile)
CONFIG_APP_REPRODUCIBLE_BUILD=y

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ----------------------------------------------------------------------------
# BLE settings
# ----------------------------------------------------------------------------

# Host stack - NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# ----------------------------------------------------------------------------
# Logging
# ----------------------------------------------------------------------------

# Default for all logging tags (including system ones, excluding bootloader)
#CONFIG_LOG_DEFAULT_LEVAL_WARN=y
#CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Default for bootloader
#CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
